---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.OffsetFacesCellLegacyFailures
source: html/881fb3b1-cb5a-29a1-122e-489826d7f79e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.OffsetFacesCellLegacyFailures

Failures related to offset faces operations.

## Syntax (C#)
```csharp
public static class OffsetFacesCellLegacyFailures
```